#!/usr/local/bin/python3
# -*- coding: utf-8 -*-
jp_map_h={
"a" :"あ", "i"  :"い", "u"  :"う", "e" :"え", "o" :"お",

"ka":"か", "ki" :"き", "ku" :"く", "ke":"け", "ko":"こ", "kya":"きゃ","kyu":"きゅ","kyo":"きょ",
"sa":"さ", "shi":"し", "su" :"す", "se":"せ", "so":"そ", "sha":"しゃ","shu":"しゅ","sho":"しょ",
"ta":"た", "chi":"ち", "tsu":"つ", "te":"て", "to":"と", "cha":"ちゃ","chu":"ちゅ","cho":"ちょ",
"na":"な", "ni" :"に", "nu" :"ぬ", "ne":"ね", "no":"の", "nya":"にゃ","nyu":"にゅ","nyo":"にょ",
"ha":"は", "hi" :"ひ", "fu" :"ふ", "he":"へ", "ho":"ほ", "hya":"ひゃ","hyu":"ひゅ","hyo":"ひょ",
"ma":"ま", "mi" :"み", "mu" :"む", "me":"め", "mo":"も", "mya":"みゃ","myu":"みゅ","myo":"みょ",

"ya":"や",             "yu" :"ゆ",            "yo":"よ",
"ra":"ら", "ri" :"り", "ru" :"る", "re":"れ", "ro":"ろ", "rya":"りゃ","ryu":"りゅ","ryo":"りょ",
"wa":"わ",                                    "wo":"を",
"n" :"ん",

"ga":"が", "gi" :"ぎ", "gu" :"ぐ", "ge":"げ", "go":"ご", "gya":"ぎゃ","gyu":"ぎゅ","gyo":"ぎょ",
"za":"ざ", "ji" :"じ", "zu" :"ず", "ze":"ぜ", "zo":"ぞ", "ja" :"じゃ","ju" :"じゅ","jo" :"じょ",
"da":"だ", "ji" :"ぢ", "zu" :"づ", "de":"で", "do":"ど", "ja" :"ぢゃ","ju" :"ぢゅ","jo" :"ぢょ",
"ba":"ば", "bi" :"び", "bu" :"ぶ", "be":"べ", "bo":"ぼ", "bya":"びゃ","byu":"びゅ","byo":"びょ",
"pa":"ぱ", "pi" :"ぴ", "pu" :"ぷ", "pe":"ぺ", "po":"ぽ", "pya":"ぴゃ","pyu":"ぴゅ","pyo":"ぴょ",
}

jp_map_k={
"a" :"ア", "i"  :"イ", "u"  :"ウ", "i" :"エ", "o" :"オ",

"ka":"カ", "ki" :"キ", "ku" :"ク", "ke":"ケ", "ko":"コ", "kya":"キャ","kyu":"キュ","kyo":"キョ",
"sa":"サ", "shi":"シ", "su" :"ス", "se":"セ", "so":"ソ", "sha":"シャ","shu":"シュ","sho":"ショ",
"ta":"タ", "chi":"チ", "tsu":"ツ", "te":"テ", "to":"ト", "cha":"チャ","chu":"チュ","cho":"チョ",
"na":"ナ", "ni" :"ニ", "nu" :"ヌ", "ne":"ネ", "no":"ノ", "nya":"ニャ","nyu":"ニュ","nyo":"ニョ",
"ha":"ハ", "hi" :"ヒ", "fu" :"フ", "he":"ヘ", "ho":"ホ", "hya":"ヒャ","hyu":"ヒュ","hyo":"ヒョ",
"ma":"マ", "mi" :"ミ", "mu" :"ム", "me":"メ", "mo":"モ", "mya":"ミャ","myu":"ミュ","myo":"ミョ",

"ya":"ヤ",             "yu" :"ユ",            "yo":"ヨ",
"ra":"ラ", "ri" :"リ", "ru" :"ル", "re":"レ", "ro":"ロ", "rya":"リャ","ryu":"リュ","ryo":"リョ",
"wa":"ワ",                                    "wo":"ヲ",
"n" :"ン",

"ga":"ガ", "gi" :"ギ", "gu" :"グ", "ge":"ゲ", "go":"ゴ", "gya":"ギャ","gyu":"ギュ","gyo":"ギョ",
"za":"ザ", "ji" :"ジ", "zu" :"ズ", "ze":"ゼ", "zo":"ゾ", "ja" :"ジャ","ju" :"ジュ","jo" :"ジョ",
"da":"ダ", "ji" :"ヂ", "zu" :"ヅ", "de":"デ", "do":"ド", "ja" :"ヂャ","ju" :"ヂュ","jo" :"ヂョ",
"ba":"バ", "bi" :"ビ", "bu" :"ブ", "be":"ベ", "bo":"ボ", "bya":"ビャ","byu":"ビュ","byo":"ビョ",
"pa":"パ", "pi" :"ピ", "pu" :"プ", "pe":"ペ", "po":"ポ", "pya":"ピャ","pyu":"ピュ","pyo":"ピョ",
}

jp_map_t={
"0_saki" :"早紀:", "1_I"   :"我", "2_like" :"喜欢", "3_you" :"你,", "4_I" :"我", "5_will":"要",
"6_go"   :"去",    "7_find":"找", "8_you"  :"你!",  "9_wait":"等",  "a_me":"我!","b_k"   :"Kkk",
}
